@echo off
title Multi Tool - by Kehlchen
chcp 65001 >nul
cd files
:start
call :banner
for /f %%A in ('"prompt $H &echo on &for %%B in (1) do rem"') do set BS=%%A
echo 1) VS Code
echo 2) Notepad++
echo 3) cmd
echo 4) PowerShell
echo 5) Run
set /p input=.%BS% ^>
if /I %input% EQU 1 start VSCode.lnk
if /I %input% EQU 2 start n++.lnk
if /I %input% EQU 3 start cmd.lnk
if /I %input% EQU 4 start powershell -Command "Start-Process powershell -Verb RunAs"
if /I %input% EQU 5 start Run.lnk
cls
goto :start

pause



:banner
echo.
echo.
echo				███╗   ███╗██╗   ██╗██╗  ████████╗██╗    ████████╗ ██████╗  ██████╗ ██╗     
echo				████╗ ████║██║   ██║██║  ╚══██╔══╝██║    ╚══██╔══╝██╔═══██╗██╔═══██╗██║     
echo				██╔████╔██║██║   ██║██║     ██║   ██║       ██║   ██║   ██║██║   ██║██║     
echo				██║╚██╔╝██║██║   ██║██║     ██║   ██║       ██║   ██║   ██║██║   ██║██║     
echo				██║ ╚═╝ ██║╚██████╔╝███████╗██║   ██║       ██║   ╚██████╔╝╚██████╔╝███████╗
echo				╚═╝     ╚═╝ ╚═════╝ ╚══════╝╚═╝   ╚═╝       ╚═╝    ╚═════╝  ╚═════╝ ╚══════╝
echo.                                                                   
echo.
